Revit 2026 API

# TransformWithBoundary Constructor

---

Constructs a new copy of the input TransformWithBoundary object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TransformWithBoundary(
	TransformWithBoundary other
)
```
```vb
Public Sub New (
	other As TransformWithBoundary
)
```
```cpp
public:
TransformWithBoundary(
	TransformWithBoundary^ other
)
```
```fsharp
new :
        other : TransformWithBoundary -> TransformWithBoundary
```

#### Parameters

other TransformWithBoundary

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TransformWithBoundary Class

Autodesk.Revit.DB Namespace